#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_service_account.cloud_run_sa: Refreshing state... [id=projects/recommendation-system-475301/serviceAccounts/cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com]
google_project_service.required_apis["monitoring.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/monitoring.googleapis.com]
google_project_service.required_apis["run.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/run.googleapis.com]
google_project_service.required_apis["bigquery.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/bigquery.googleapis.com]
google_project_service.required_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/artifactregistry.googleapis.com]
google_project_service.required_apis["logging.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/logging.googleapis.com]
google_project_service.required_apis["cloudbuild.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/cloudbuild.googleapis.com]
google_project_service.required_apis["aiplatform.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/aiplatform.googleapis.com]
google_logging_metric.prediction_errors[0]: Refreshing state... [id=goodreads-prediction-errors]
google_monitoring_dashboard.model_dashboard[0]: Refreshing state... [id=projects/491512947755/dashboards/03a733a9-4097-49cc-b5b1-668319734f9b]
google_service_account.model_serving[0]: Refreshing state... [id=projects/recommendation-system-475301/serviceAccounts/goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com]
google_logging_metric.deployment_events[0]: Refreshing state... [id=goodreads-deployment-events]
data.google_project.current: Reading...
google_logging_metric.prediction_count[0]: Refreshing state... [id=goodreads-prediction-count]
google_service_account.model_deployer[0]: Refreshing state... [id=projects/recommendation-system-475301/serviceAccounts/goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_sa_bigquery_user: Refreshing state... [id=recommendation-system-475301/roles/bigquery.user/serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com]
data.google_project.current: Read complete after 0s [id=projects/recommendation-system-475301]
google_cloud_run_v2_service.recommendation_service[0]: Refreshing state... [id=projects/recommendation-system-475301/locations/us-central1/services/recommendation-service]
google_project_iam_member.cloud_run_sa_bigquery_data_viewer: Refreshing state... [id=recommendation-system-475301/roles/bigquery.dataViewer/serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_sa_bigquery_data_editor: Refreshing state... [id=recommendation-system-475301/roles/bigquery.dataEditor/serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.serving_logging[0]: Refreshing state... [id=recommendation-system-475301/roles/logging.logWriter/serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.serving_vertex_user[0]: Refreshing state... [id=recommendation-system-475301/roles/aiplatform.user/serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.serving_bigquery_reader[0]: Refreshing state... [id=recommendation-system-475301/roles/bigquery.dataViewer/serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.deployer_bigquery_reader[0]: Refreshing state... [id=recommendation-system-475301/roles/bigquery.dataViewer/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.deployer_vertex_admin[0]: Refreshing state... [id=recommendation-system-475301/roles/aiplatform.admin/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.deployer_storage_admin[0]: Refreshing state... [id=recommendation-system-475301/roles/storage.admin/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_service_account_iam_member.deployer_can_impersonate_serving[0]: Refreshing state... [id=projects/recommendation-system-475301/serviceAccounts/goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.deployer_logging[0]: Refreshing state... [id=recommendation-system-475301/roles/logging.logWriter/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.public_invoker[0]: Refreshing state... [id=v1/projects/recommendation-system-475301/locations/us-central1/services/recommendation-service/roles/run.invoker/allUsers]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/recommendation-system-475301/locations/us-central1/repositories/recommendation-service]
google_vertex_ai_endpoint.recommendation_endpoint: Refreshing state... [id=projects/recommendation-system-475301/locations/us-central1/endpoints/goodreads-recommendation-endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_service_iam_member.public_invoker[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_cloud_run_service_iam_member" "public_invoker" {
      - etag     = "BwZFPsPKZfM=" -> null
      - id       = "v1/projects/recommendation-system-475301/locations/us-central1/services/recommendation-service/roles/run.invoker/allUsers" -> null
      - location = "us-central1" -> null
      - member   = "allUsers" -> null
      - project  = "recommendation-system-475301" -> null
      - role     = "roles/run.invoker" -> null
      - service  = "v1/projects/recommendation-system-475301/locations/us-central1/services/recommendation-service" -> null
    }

  # google_cloud_run_v2_service.recommendation_service[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_cloud_run_v2_service" "recommendation_service" {
      - annotations             = {} -> null
      - conditions              = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-12-06T01:48:48.493354Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "RoutesReady"
            },
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-12-06T01:48:24.024473Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
            },
        ] -> null
      - create_time             = "2025-12-06T01:46:33.304770Z" -> null
      - creator                 = "goodreads-books@recommendation-system-475301.iam.gserviceaccount.com" -> null
      - custom_audiences        = [] -> null
      - default_uri_disabled    = false -> null
      - deletion_protection     = false -> null
      - effective_annotations   = {} -> null
      - effective_labels        = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - etag                    = "\"CPmVzskGENDXqZEB/cHJvamVjdHMvcmVjb21tZW5kYXRpb24tc3lzdGVtLTQ3NTMwMS9sb2NhdGlvbnMvdXMtY2VudHJhbDEvc2VydmljZXMvcmVjb21tZW5kYXRpb24tc2VydmljZQ\"" -> null
      - generation              = "1" -> null
      - id                      = "projects/recommendation-system-475301/locations/us-central1/services/recommendation-service" -> null
      - ingress                 = "INGRESS_TRAFFIC_ALL" -> null
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      - last_modifier           = "goodreads-books@recommendation-system-475301.iam.gserviceaccount.com" -> null
      - latest_created_revision = "projects/recommendation-system-475301/locations/us-central1/services/recommendation-service/revisions/recommendation-service-00001-mts" -> null
      - latest_ready_revision   = "projects/recommendation-system-475301/locations/us-central1/services/recommendation-service/revisions/recommendation-service-00001-mts" -> null
      - launch_stage            = "GA" -> null
      - location                = "us-central1" -> null
      - name                    = "recommendation-service" -> null
      - observed_generation     = "1" -> null
      - project                 = "recommendation-system-475301" -> null
      - reconciling             = false -> null
      - terminal_condition      = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-12-06T01:48:48.541679Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "Ready"
            },
        ] -> null
      - terraform_labels        = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - traffic_statuses        = [
          - {
              - percent  = 100
              - revision = ""
              - tag      = ""
              - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
              - uri      = ""
            },
        ] -> null
      - uid                     = "5dc64290-a7b0-45e0-a166-9407bdf65ed1" -> null
      - update_time             = "2025-12-06T01:46:33.304770Z" -> null
      - uri                     = "https://recommendation-service-ndhndqk5fq-uc.a.run.app" -> null
      - urls                    = [
          - "https://recommendation-service-491512947755.us-central1.run.app",
          - "https://recommendation-service-ndhndqk5fq-uc.a.run.app",
        ] -> null

      - template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - health_check_disabled            = false -> null
          - labels                           = {} -> null
          - max_instance_request_concurrency = 80 -> null
          - service_account                  = "cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com" -> null
          - session_affinity                 = false -> null
          - timeout                          = "300s" -> null

          - containers {
              - args       = [] -> null
              - build_info = [] -> null
              - command    = [] -> null
              - depends_on = [] -> null
              - image      = "us-central1-docker.pkg.dev/recommendation-system-475301/recommendation-service/recommendation-service:63450b2c8d8019e9fe3d0116859bb607bc0bebf7" -> null

              - ports {
                  - container_port = 8080 -> null
                  - name           = "http1" -> null
                }

              - resources {
                  - cpu_idle          = true -> null
                  - limits            = {
                      - "cpu"    = "1000m"
                      - "memory" = "512Mi"
                    } -> null
                  - startup_cpu_boost = false -> null
                }

              - startup_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 240 -> null
                  - timeout_seconds       = 240 -> null

                  - tcp_socket {
                      - port = 8080 -> null
                    }
                }
            }

          - scaling {
              - max_instance_count = 3 -> null
              - min_instance_count = 0 -> null
            }
        }

      - traffic {
          - percent = 100 -> null
          - type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
        }
    }

  # google_monitoring_alert_policy.data_drift_alert[0] will be created
  + resource "google_monitoring_alert_policy" "data_drift_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Goodreads Data Drift Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = []
      + project               = "recommendation-system-475301"

      + alert_strategy {
          + auto_close = "86400s"
        }

      + conditions {
          + display_name = "PSI Exceeds Threshold"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "0s"
              + filter          = "metric.type=\"custom.googleapis.com/ml/goodreads/drift_psi\" AND resource.type=\"global\""
              + threshold_value = 0.2

              + aggregations {
                  + alignment_period   = "3600s"
                  + per_series_aligner = "ALIGN_MAX"
                }
            }
        }

      + documentation {
          + content   = <<-EOT
                ## Data Drift Detected
                
                Significant data drift has been detected in one or more features.
                
                **What this means:**
                - The distribution of input data has shifted from the training baseline
                - Model predictions may become less accurate
                
                **Recommended Actions:**
                1. Review drift reports in `docs/monitoring_reports/`
                2. Investigate recent data changes
                3. Consider retraining the model with recent data
                
                **PSI Interpretation:**
                - PSI < 0.1: No significant shift
                - 0.1 <= PSI < 0.2: Moderate shift (monitor)
                - PSI >= 0.2: Significant shift (action required)
            EOT
          + mime_type = "text/markdown"
        }
    }

  # google_monitoring_alert_policy.model_decay_alert[0] will be created
  + resource "google_monitoring_alert_policy" "model_decay_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Goodreads Model Decay Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = []
      + project               = "recommendation-system-475301"

      + alert_strategy {
          + auto_close = "86400s"
        }

      + conditions {
          + display_name = "RMSE Exceeds Threshold"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"custom.googleapis.com/ml/goodreads/rmse\" AND resource.type=\"global\""
              + threshold_value = 1.5

              + aggregations {
                  + alignment_period   = "3600s"
                  + per_series_aligner = "ALIGN_MEAN"
                }

              + trigger {
                  + count = 3
                }
            }
        }
      + conditions {
          + display_name = "R-squared Below Threshold"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_LT"
              + duration        = "300s"
              + filter          = "metric.type=\"custom.googleapis.com/ml/goodreads/r_squared\" AND resource.type=\"global\""
              + threshold_value = 0.3

              + aggregations {
                  + alignment_period   = "3600s"
                  + per_series_aligner = "ALIGN_MEAN"
                }
            }
        }

      + documentation {
          + content   = <<-EOT
                ## Model Decay Detected
                
                The Goodreads recommendation model is showing signs of performance degradation.
                
                **Recommended Actions:**
                1. Check recent data drift reports in `docs/monitoring_reports/`
                2. Review MLflow experiment tracking for metric trends
                3. Consider triggering model retraining if drift is confirmed
                4. Validate data pipeline for any anomalies
                
                **Dashboard:** Access the monitoring dashboard at `/report`
            EOT
          + mime_type = "text/markdown"
        }
    }

  # google_monitoring_metric_descriptor.data_drift_psi[0] will be created
  + resource "google_monitoring_metric_descriptor" "data_drift_psi" {
      + description              = "Population Stability Index for data drift detection"
      + display_name             = "Data Drift PSI"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/drift_psi"
      + unit                     = "1"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the feature being monitored"
          + key         = "feature_name"
          + value_type  = "STRING"
        }
    }

  # google_monitoring_metric_descriptor.ml_accuracy[0] will be created
  + resource "google_monitoring_metric_descriptor" "ml_accuracy" {
      + description              = "Prediction accuracy within tolerance"
      + display_name             = "Model Accuracy"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/accuracy"
      + unit                     = "%"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the ML model"
          + key         = "model_name"
          + value_type  = "STRING"
        }
      + labels {
          + description = "Tolerance level (0.5 or 1.0)"
          + key         = "tolerance"
          + value_type  = "STRING"
        }
    }

  # google_monitoring_metric_descriptor.ml_mae[0] will be created
  + resource "google_monitoring_metric_descriptor" "ml_mae" {
      + description              = "Mean Absolute Error for ML model predictions"
      + display_name             = "Model MAE"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/mae"
      + unit                     = "1"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the ML model"
          + key         = "model_name"
          + value_type  = "STRING"
        }
    }

  # google_monitoring_metric_descriptor.ml_r_squared[0] will be created
  + resource "google_monitoring_metric_descriptor" "ml_r_squared" {
      + description              = "R-squared coefficient for ML model predictions"
      + display_name             = "Model R-squared"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/r_squared"
      + unit                     = "1"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the ML model"
          + key         = "model_name"
          + value_type  = "STRING"
        }
    }

  # google_monitoring_metric_descriptor.ml_rmse[0] will be created
  + resource "google_monitoring_metric_descriptor" "ml_rmse" {
      + description              = "Root Mean Square Error for ML model predictions"
      + display_name             = "Model RMSE"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/rmse"
      + unit                     = "1"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the ML model"
          + key         = "model_name"
          + value_type  = "STRING"
        }
    }

Plan: 7 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @purva-agarwal, Action: `pull_request`, Workflow: `Terraform Infrastructure`*